Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.analysisObject
Analyis object.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.name
Name.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.type
The type of the material.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.dampingFactor
The damping factor of the material.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.density
The density of the material.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.modulusOfElasticity
Modulus of elasticity.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.poissonsRatio
Poissons ratio.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.thermalDilatation
Thermal dilatation.